Revit 2026 API

# DirectShapeOptionsReferencingOption Property

---

Whether or not the geometry stored in a DirectShape object may be referenced.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DirectShapeReferencingOption ReferencingOption { get; set; }
```
```vb
Public Property ReferencingOption As DirectShapeReferencingOption
	Get
	Set
```
```cpp
public:
property DirectShapeReferencingOption ReferencingOption {
	DirectShapeReferencingOption get ();
	void set (DirectShapeReferencingOption value);
}
```
```fsharp
member ReferencingOption : DirectShapeReferencingOption with get, set
```

#### Property Value

DirectShapeReferencingOption The default value is Referenceable.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

If the geometry is not referenceable, it may not be used for dimensioning, snapping, alignment, or face-hosting. The element may still be selected by the user for operations which do not reference individual geometry objects.

#### Reference

DirectShapeOptions Class

Autodesk.Revit.DB Namespace